{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/shirokuriwaki/Dropbox/stata-notes/01_stata.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 3 Sep 2018, 14:46:59
{txt}
{com}. //_1
. use sample_data.dta
{txt}
{com}. //_2
. import delimited using sample_data.csv, clear
{res}{text}(7 vars, 435 obs)

{com}. //_3
. clear all
{res}{txt}
{com}. //_4
. sysuse nlsw88
{txt}(NLSW, 1988 extract)

{com}. //_5
. describe

{txt}Contains data from {res}/Applications/Stata/ado/base/n/nlsw88.dta
{txt}  obs:{res}         2,246                          NLSW, 1988 extract
{txt} vars:{res}            17                          1 May 2016 22:52
{txt} size:{res}        60,642                          (_dta has notes)
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:idcode         }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}NLS id{p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}age in current year{p_end}
{p 0 48}{bind:race           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:racelbl  }{bind:  }{res}{res}race{p_end}
{p 0 48}{bind:married        }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:marlbl   }{bind:  }{res}{res}married{p_end}
{p 0 48}{bind:never_married  }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}never married{p_end}
{p 0 48}{bind:grade          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}current grade completed{p_end}
{p 0 48}{bind:collgrad       }{txt}{bind: byte    }{bind:{txt}%16.0g    }{space 1}{bind:gradlbl  }{bind:  }{res}{res}college graduate{p_end}
{p 0 48}{bind:south          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}lives in south{p_end}
{p 0 48}{bind:smsa           }{txt}{bind: byte    }{bind:{txt}%9.0g     }{space 1}{bind:smsalbl  }{bind:  }{res}{res}lives in SMSA{p_end}
{p 0 48}{bind:c_city         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}lives in central city{p_end}
{p 0 48}{bind:industry       }{txt}{bind: byte    }{bind:{txt}%23.0g    }{space 1}{bind:indlbl   }{bind:  }{res}{res}industry{p_end}
{p 0 48}{bind:occupation     }{txt}{bind: byte    }{bind:{txt}%22.0g    }{space 1}{bind:occlbl   }{bind:  }{res}{res}occupation{p_end}
{p 0 48}{bind:union          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:unionlbl }{bind:  }{res}{res}union worker{p_end}
{p 0 48}{bind:wage           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hourly wage{p_end}
{p 0 48}{bind:hours          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}usual hours worked{p_end}
{p 0 48}{bind:ttl_exp        }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}total work experience{p_end}
{p 0 48}{bind:tenure         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}job tenure (years){p_end}
{txt}{hline}
Sorted by: {res}idcode
{txt}
{com}. //_6
. sum age

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}      2,246    39.15316    3.060002         34         46
{txt}
{com}. //_7
. sum age, detail

                     {txt}age in current year
{hline 61}
      Percentiles      Smallest
 1%    {res}       34             34
{txt} 5%    {res}       35             34
{txt}10%    {res}       35             34       {txt}Obs         {res}      2,246
{txt}25%    {res}       36             34       {txt}Sum of Wgt. {res}      2,246

{txt}50%    {res}       39                      {txt}Mean          {res} 39.15316
                        {txt}Largest       Std. Dev.     {res} 3.060002
{txt}75%    {res}       42             45
{txt}90%    {res}       44             45       {txt}Variance      {res} 9.363614
{txt}95%    {res}       44             46       {txt}Skewness      {res} .2003234
{txt}99%    {res}       45             46       {txt}Kurtosis      {res} 1.932389
{txt}
{com}. //_8
. tabstat age, stat(mean sd median iqr)

{txt}{ralign 12:variable} {...}
{c |}      mean        sd       p50       iqr
{hline 13}{c +}{hline 40}
{ralign 12:age} {...}
{c |}{...}
 {res} 39.15316  3.060002        39         6
{txt}{hline 13}{c BT}{hline 40}

{com}. //_9
. gen weekly_wage = wage * hours
{txt}(4 missing values generated)

{com}. //_10
. label variable weekly_wage "weekly wage (estimate)"
{txt}
{com}. //_11
. gen foo = (age)^2
{txt}
{com}. replace foo = 0
{txt}(2,246 real changes made)

{com}. //_12
. drop foo
{txt}
{com}. //_13
. count
  {res}2,246
{txt}
{com}. //_14
. count if south == 1
  {res}942
{txt}
{com}. //_15
. tabulate c_city

   {txt}lives in {c |}
    central {c |}
       city {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      1,591       70.84       70.84
{txt}          1 {c |}{res}        655       29.16      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      2,246      100.00
{txt}
{com}. //_16
. tabulate c_city union

  {txt}lives in {c |}
   central {c |}     union worker
      city {c |}  nonunion      union {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}     1,034        288 {txt}{c |}{res}     1,322 
{txt}         1 {c |}{res}       383        173 {txt}{c |}{res}       556 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}     1,417        461 {txt}{c |}{res}     1,878 

{txt}
{com}. //_17
. set scheme s2mono, permanently
{txt}({cmd:set scheme} preference recorded)

{com}. //_18
. hist wage
{txt}(bin={res}33{txt}, start={res}1.0049518{txt}, width={res}1.2042921{txt})
{res}{txt}
{com}. graph export hist_wage.png, width(2000) replace
{txt}(file hist_wage.png written in PNG format)

{com}. //_19
. scatter weekly_wage grade
{res}{txt}
{com}. graph export edu_wage.png, width(1800) replace
{txt}(file edu_wage.png written in PNG format)

{com}. //_20
. scatter weekly_wage grade, mcolor(%30)
{res}{txt}
{com}. graph export edu_wage_alpha.png, width(1800) replace
{txt}(file edu_wage_alpha.png written in PNG format)

{com}. //_21
. hist wage if race == "black":racelbl
{txt}(bin={res}24{txt}, start={res}1.1513683{txt}, width={res}1.6498009{txt})
{res}{txt}
{com}. graph export wage_blk.png, width(2000) replace
{txt}(file wage_blk.png written in PNG format)

{com}. //_22
. graph box wage, over(race)
{res}{txt}
{com}. graph export race_wage.png, width(2000) replace
{txt}(file race_wage.png written in PNG format)

{com}. //_23
. scatter weekly_wage grade if race == "black":racelbl, /// 
>    title("Black Women") name(blk_edu_wage, replace) 
{res}{txt}
{com}. scatter weekly_wage grade if race == "white":racelbl, ///
>    title("White Women") name(wht_edu_wage, replace)
{res}{txt}
{com}. graph combine blk_edu_wage wht_edu_wage, ysize(2) xsize(3)
{res}{txt}
{com}. graph export race_edu_wage.png, width(2000) replace
{txt}(file race_edu_wage.png written in PNG format)

{com}. //_^
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/shirokuriwaki/Dropbox/stata-notes/01_stata.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res} 3 Sep 2018, 14:47:16
{txt}{.-}
{smcl}
{txt}{sf}{ul off}